app/Http/Controllers/Frontend/CartController.php

select * from `products` where `products`.`id` = '4' limit 1
---
    public function addToCart(Request $request)
    {
        $product = Product::findOrFail($request->product_id);