app/Http/Controllers/Frontend/FrontendProductController.php

    public function showProduct(string $slug)
    {
        $product = Product::with(['vendor', 'category', 'productImageGalleries', 'variants', 'brand'])->where('slug', $slug)->where('status', 1)->first();
---
select * from `brands` where `brands`.`id` in (1)
select * from `categories` where `categories`.`id` in (3)
select * from `product_image_galleries` where `product_image_galleries`.`product_id` in (4)
select * from `products` where `slug` = 'alfonso-guerra' and `status` = 1 limit 1