app/Http/Controllers/Frontend/HomeController.php

    public function index(){

        $sliders = Slider::where('status' ,1)->orderBy('serial', 'asc')->get();
        $flashSaleDate = FlashSale::first();
        $flashSaleItems = FlashSaleItem::where('show_at_home', 1)->where('status', 1)->get();
---
select * from `sliders` where `status` = 1 order by `serial` asc
select * from `flash_sales` limit 1
select * from `flash_sale_items` where `show_at_home` = 1 and `status` = 1