app/Http/Controllers/Frontend/UserAddressController.php

    public function index()
    {
        $addresses = UserAddress::where('user_id', Auth::user()->id)->get();
---
select * from `user_addresses` where `user_id` = 1