app/Http/Controllers/Backend/FlashSaleController.php

select * from `flash_sales` limit 1
select * from `products` where `is_approved` = 1 and `status` = 1 order by `id` desc
---
    public function index(FlashSaleItemDataTable $dataTable)
    {
        $flashSaleDate = FlashSale::first();
        $products      = Product::where('is_approved', 1)->where('status', 1)->orderBy('id', 'DESC' )->get();