app/Http/Controllers/Backend/ProductController.php

select * from `categories`
select * from `brands`
---
    public function create()
    {
        $categories = Category::all();
        $brands     = Brand::all();

select * from `sub_categories` where `category_id` = '2'
---
    public function getSubCategories(Request $request)
    {
        $subCategories = SubCategory::where('category_id', $request->id)->get();