app/Http/Controllers/Backend/vendorProductVariantItemController.php

    public function index(VendorProductVariantItemDataTable $dataTable, $productId, $variantId)
    {
        $product = Product::findOrFail($productId);

        $variant = ProductVariant::findOrFail($variantId);
---
select * from `products` where `products`.`id` = '5' limit 1
select * from `product_variants` where `product_variants`.`id` = '6' limit 1

    public function create(string $productId, string $variantId)
    {
        $variant = ProductVariant::findOrFail($variantId);
        $product = Product::findOrFail($productId);
---
select * from `product_variants` where `product_variants`.`id` = '6' limit 1
select * from `products` where `products`.`id` = '5' limit 1