app/Http/Controllers/Backend/VendorProductController.php

    public function create()
    {
        $categories = Category::all();
        $brands     = Brand::all();
---
select * from `categories`
select * from `brands`

    public function getChildCategories(Request $request)
    {
        $childCategories = ChildCategory::where('sub_category_id', $request->id)->get();
---
select * from `child_categories` where `sub_category_id` = '5'